In [ ]:
import pandas as pd

In [ ]:
list_var = ['a','b','c','d']

In [ ]:
type(list_var)

In [ ]:
series_var = pd.Series(list_var, index = [1, 2, 3, 4])

In [ ]:
series_var

In [ ]:
type(series_var)

In [ ]:
series_var2 = pd.Series({1:'a', 2:'b', 3:'c', 4:'d'})

In [ ]:
series_var2

In [ ]:
series_var2[1]

## DataFrame

- DataFrame = Series + Series + Series + Series + ....

In [ ]:
df = pd. DataFrame( {'name' :['yejin', 'jiwon', 'sanghyeon'],
                     'age':['25', '22', '32'],
                     'gender':['F', 'F', 'M']})

In [ ]:
df

In [ ]:
df['name']

In [ ]:
df['age']

In [ ]:
df.info()

In [ ]:
df.head() #.head 위에서 부터 5개를 불러온다.

In [ ]:
df.tail() #.tail 아래에서 부터 5개를 불러온다.

In [ ]:
import pandas as pd

In [ ]:
df = pd. DataFrame( {'name' :['yejin', 'jiwon', 'sanghyeon'],
                     'age':['25', '22', '32'],
                     'gender':['1', '1', '0']})

In [ ]:
df['age']

In [ ]:
df['age'].astype(int)

In [ ]:
df['age']

In [ ]:
df['age'] = df['age'].astype(int)

In [ ]:
df['age']

In [ ]:
print(df['age'].sum()) # 합
print(df['age'].mean()) # 평균
print(df['age'].median()) # 중앙값
print(df['age'].max()) # 최대
print(df['age'].min()) # 최소
print(df['age'].var())# 분산
print(df['age'].std()) # 표준편차

In [ ]:
df.describe()

In [ ]:
df[(df['age'] > 20) & (df['gender'] == '1')]

In [ ]:
df[(df['age'] > 20) | (df['gender'] == '1')]

### loc(index기반), iloc(위치 또는 순서 기반)

In [ ]:
#loc(index기반)
df = pd. DataFrame( {'name' :['yejin', 'jiwon', 'sanghyeon'],
                     'age':['25', '22', '32'],
                     'gender':['1', '1', '0']}, index=['a','b','c'])

In [ ]:
df.loc['a']

In [ ]:
df.iloc[0]

In [ ]:
df.iloc[0]['age']

In [ ]:
df.iloc[0].age

In [ ]:
df.iloc[0]['name']

In [ ]:
df.iloc[0].name

## DataFrame 합치기

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A':[1,2,3,4],
                    'B':[5,6,7,8],
                    'C':[9,10,11,12]})
df2= pd.DataFrame({'A':[13,14,15,16],
                   'B':[17,18,19,20],
                   'C':[21,22,23,24]})

In [3]:
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [4]:
df2

    A   B   C
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [5]:
df3 = pd.concat([df1, df2])

In [6]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [7]:
df3.reset_index()

   index   A   B   C
0      0   1   5   9
1      1   2   6  10
2      2   3   7  11
3      3   4   8  12
4      0  13  17  21
5      1  14  18  22
6      2  15  19  23
7      3  16  20  24

In [8]:
df3.reset_index(drop=True)

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [9]:
df3 = df3.reset_index(drop=True)

In [10]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [11]:
pd.concat([df1, df2], axis=1) #axis=1(열), axis=0(행)

   A  B   C   A   B   C
0  1  5   9  13  17  21
1  2  6  10  14  18  22
2  3  7  11  15  19  23
3  4  8  12  16  20  24

In [12]:
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [13]:
df1['D'] = [13,14,15,16]

In [14]:
df1

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [15]:
df1.drop('A', axis=1)

   B   C   D
0  5   9  13
1  6  10  14
2  7  11  15
3  8  12  16

In [16]:
df1.drop('A', axis=1)

   B   C   D
0  5   9  13
1  6  10  14
2  7  11  15
3  8  12  16

In [17]:
df1

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [18]:
df1.drop('A', axis=1, inplace=True) #=  df1 = df1.drop('A', axis=1)

In [19]:
df1

   B   C   D
0  5   9  13
1  6  10  14
2  7  11  15
3  8  12  16

## Groupby

In [20]:
data = { 'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person':['Sam', 'Charlie', 'Amy', 'Veanessa', 'Carl', 'Sarah'],
        'Sales':[200, 120, 340, 124, 243, 350]}

In [21]:
df = pd.DataFrame(data)

In [22]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Veanessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [23]:
df['Company'].value_counts()

GOOG    2
MSFT    2
FB      2
Name: Company, dtype: int64

In [25]:
#회사별 세일즈 값의 평균
df['Company'].min()

'FB'